{
    "Vk_API": {
        "bad_connection": "У вас отсутствует интернет подключение! Невозможно выполнить подключение! "
    },
    "Preparation_of_data": {
        "invalid_age_value": "Вы ввели некорректное значение возраста\n\nВозраст не может быть строкой\n\nВозраст не может быть больше 90 и меньше 18.",
        "invalid_friends_value": "Вы ввели некорректное значение в поле 'Количество друзей'\n\nПоле может содержать только положительное число от 0 до {}, а также поле 'От' не может быть больше 'До'",
        "invalid_followers_value": "Вы ввели некорректное значение в поле 'Количество подписчиков'\n\nПоле может содержать только положительное число от 0 до {}, а также поле 'От' не может быть больше 'До'",
        "invalid_group_id_value": "Мне не удалось найти грппу с таким id\n\nid: {}",
        "invalid_value_friends_or_followers": "Значения полей 'Друзья' и 'Подписчики' могут содержать только числа"
    },
    "Update_app": {
        "Bad_connect": "Ваша версия: {VERSION}\n\nПлохое подключение к интернету. Мы не смогли выполнить обновление.\n\nВы можете скачать новую версию самостоятельно, либо рассказать об ошибке в боте ВК"
    },
    "Parsing": {
        "Bad_connection": "У вас нет подключения к интернету, парсинг невозможен\n\n{error}",
        "Bad_token": "Ваш токен неверен.\n\nАвторизуйтесь на главной странице программы",
        "Dont_choose_pk": "Для парсинга надо выбрать запись по которой будет он произведён\n\nЗапись можно выбрать, нажав на кнопку \"Выбрать\"\n\nЕсли там нет записей, то выполните париснг по группам в первой подвкалдке вкладки \"Парсинг\", не ставя галочку у поля с отменой сбора дополнительных параметров.",
        "Validate_follower": {
            "Not_int": "Значения полей \"Подписчиков\" могут содержать только числа",
            "From_more_to": "Значение поля \"Подписчиков\" \"От\" не может быть больше \"До\"",
            "Max_value": "Значения полей \"Подписчиков\" не может быть больше {FOLLOWERS_MAX}"
        },
        "Validate_old": {
            "From_more_to": "Значение поля \"Возраст\" \"От\" не может быть больше \"До\""
        },
        "Validate_last_seen": {
            "Not_int": "Значения полей \"Последний раз в сети\" могут содержать только числа",
            "From_more_to": "Значение поля \"Последний раз в сети\" \"От\" не может быть больше \"До\"",
            "Max_value": "Значения полей \"Друзей\" не может быть больше {LAST_SEEN_MAX}"
        },
        "Validate_status": {
            "Empty": "Вы выбрали возможность парсинга по ключевому значению статуса, но оставили это поле пустым!"
        },
        "Validate_about": {
            "Empty": "Вы выбрали возможность парсинга по ключевому значению Обо мне, но оставили это поле пустым!"
        }
    },
    "Unforeseen_error": "Мы не предвидели эту ошибку, обратитесь с ней к автору программы\n\nОшибка: {}"
}